{
  "summary": "1. *Vibravox: A Dataset of French Speech Captured with Body-conduction Audio Sensors*: Vibravox is a dataset compliant with GDPR containing audio recordings with five different body-conduction audio sensors. Experiments conducted on the dataset show promising results for various speech-related tasks.\n\n2. *DeepGate3: Towards Scalable Circuit Representation Learning*: DeepGate3 enhances circuit representation learning using Transformer modules after Graph Neural Networks processing, improving scalability and generalizability over traditional models.\n\n3. *Static and multivariate-temporal attentive fusion transformer for readmission risk prediction*: SMTAFormer is proposed for ICU patient readmission prediction by leveraging static and temporal data fusion through an attention mechanism, resulting in significant performance improvements.\n\n4. *CodeV: Empowering LLMs for Verilog Generation through Multi-Level Summarization*: CodeV introduces a method to improve Verilog code generation by using multi-level summarization instead of instruction tuning data, outperforming existing models significantly.\n\n5. *GraphPrint: Extracting Features from 3D Protein Structure for Drug Target Affinity Prediction*: GraphPrint incorporates 3D protein structure features for drug target affinity prediction, achieving lower mean square error and higher concordance index compared to traditional features alone.\n\n6. *BandControlNet: Parallel Transformers-based Steerable Popular Music Generation with Fine-Grained Spatiotemporal Features*: BandControlNet proposes a conditional model based on parallel Transformers for music generation, outperforming other models in terms of fidelity and speed.\n\n7. *GROOT: Generating Robust Watermark for Diffusion-Model-Based Audio Synthesis*: Groot introduces a generative robust audio watermarking technique, outperforming state-of-the-art methods in robustness against various attacks while maintaining high watermark extraction accuracy.\n\n8. *Three Dogmas of Reinforcement Learning*: The paper discusses three dogmas conditioning reinforcement learning and proposes shedding two of them to unleash the full potential of reinforcement learning as a research frame for intelligent agents.\n\n9. *XEQ Scale for Evaluating XAI Experience Quality Grounded in Psychometric Theory*: XEQ Scale is introduced for evaluating user-centered quality of XAI experiences, providing a comprehensive framework across learning, utility, fulfillment, and engagement dimensions.\n\n10. *Classification of Heart Sounds Using Multi-Branch Deep Convolutional Network and LSTM-CNN*: The paper presents a method for diagnosing cardiac abnormalities accurately using a Multi-Branch Deep Convolutional Neural Network combined with Long Short-Term Memory layers, outperforming traditional methods."
}